CBE60546-syllabus.tex
% Created 2025-08-22 Fri 11:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage[top=1in, bottom=1in, left=1in, right=1in]{geometry}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[theorems, skins]{tcolorbox}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage[cache=false]{minted}
\usepackage[strings]{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage{setspace}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2025 W.\ F.\ Schneider}
\rfoot{\thepage}
\title{University of Notre Dame\\Advanced Chemical Engineering Thermodynamics\\(CBE 60553)}
\author{Prof. William F.\ Schneider}
\usepackage{titlesec}
\titlespacing*{\section}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\titlespacing*{\subsection}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\titlespacing*{\subsubsection}
{0pt}{0.4\baselineskip}{0.1\baselineskip}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60546 Syllabus}
\begin{document}

\begin{OPTIONS}
\end{OPTIONS}

\begin{center}
\textsc{\Large Advanced Chemical Reaction Engineering (CBE 60546)}\\University of Notre Dame, Fall 2025
Prof.\ Bill Schneider (\email{wschneider@nd.edu})
\end{center}
\begin{tabular*}{\textwidth}{@{\extracolsep{\fill}}l r}
\hline
283 Galvin Hall & Lecture MW 8:35-9:50 am\\
\hline
\end{tabular*}
\section{Reactions and Reactors}
\label{sec:org8736af6}
Chemical reaction engineering is ``par excellence the domain of the chemical engineer'' (R. Aris)---the analysis and design of chemical reactors (big and small) to economically produce useful products.  The utility of the concepts, though, go well beyond the Haber-Bosch reactors that launched the field or the fluidized catalytic crackers responsible for the wide availability of inexpensive and high quality gasoline.  Reaction engineering ties together virtually all elements of Chemical Engineering, from thermodynamics and chemical kinetics to mass and energy balances to mass and heat transfer.  

We will approach this from a bottom up perspective, starting from the most basic concepts of chemical reactions, reaction thermodynamics, chemical kinetics, and catalysis, to the development and application of mass and energy balances for simple to more complicated reactors. 

I strongly encourage you to keep up with the material and homework, to use the resources available and to find your own resources, and to bring up questions in class. Don’t be bashful: if you don’t understand something, chances are that many of your classmates (and quite possibly your instructor!) don’t either.
\section{Text}
\label{sec:org3fd3228}
There are many good reaction engineering texts. We won't use or follow any one in particular. Some that I find useful include: 

\begin{itemize}
\item Hill and Root, \emph{Introduction to Chemical Engineering Kinetcs \& Reactor Design}, 2nd edition, Wiley 2014
\item Davis and Davis, \emph{Fundamentals of Chemical Reaction Engineering}, McGraw-Hill. Available online \href{https://authors.library.caltech.edu/25070/}{here}.
\item Rawlings and Ekerdt, \emph{Chemical Reactor Analysis and Design Fundamentals}, 2nd edition, Nob Hill. Useful information \href{https://sites.engineering.ucsb.edu/\~jbraw/chemreacfun/}{here}.
\item Schmidt, \emph{The Engineering of Chemical Reactions}, 2nd edition, Oxford 2005. Available online \href{https://app.knovel.com/kn/resources/kpECRE0001/toc}{here}.
\end{itemize}
\section{Format}
\label{sec:org9ea72dc}
The topics will be presented in a series of self-contained lectures as outlined on the website. Lecture notes for each lecture will be posted on-line. Attendance is expected, and you should be prepared to ask and answer questions. \textbf{All electronic devices will be turned off and put away during lecture.}
\subsection{Brief Outline of Course Topics (aspirational!)}
\label{sec:org11f1997}
\begin{enumerate}
\item Stoichiometry
\item Chemical Thermodynamics and Equilibria
\item Empirical Kinetics
\item Molecular Basis of Chemical Kinetics
\item Mechanisms of Chemical Reactions
\item Heterogeneous Reactions and Catalysis
\item Liquid Phase Reactions-maybe
\item Ideal Reactor Design
\item Reactor Optimization
\item Non-isothermal Reactors
\item Non-ideal flow
\item Catalytic reactor design
\item Bioreactors
\end{enumerate}
\section{Online Resources}
\label{sec:orgce3b4d6}
This syllabus, the homework assignments and solutions, and written lecture notes are available on the web at \url{https://github.com/wmfschneider/CBE60546}.  If you want to get your own copy of all this material and understand a bit about how git works, see \url{http://rogerdudler.github.io/git-guide/}.  Or just download files directly from the git site. The source files are written using Org Mode (\url{https://orgmode.org/}), but you can read them using a regular text editor if you want to see under the hood.

A course calendar is available on Google at \href{https://calendar.google.com/calendar/b/1?cid=NWJwN2pmMjI5bTdoYmFvM2R0cXM2NjYzOThAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ}{WFS Courses}.
\section{Homework}
\label{sec:org49f998b}
Ten problem sets will be distributed during the semester and will be due at the beginning of class on dates to be announced. The problem sets will be designed to reinforce your knowledge and ability to apply the course material.  \textbf{Assignments turned in late will automatically lose 20\%, and those turned in after the solutions are posted will not be accepted.}  Your lowest two scores on homework will be dropped.  You may discuss the homework with your classmates, but \textbf{what you turn in must be your own work.} You will turn in your homework on \href{https://www.gradescope.com/courses/933965}{Gradescope}.
\subsection{Jupyter/Python}
\label{sec:org235db4b}
Homework will be distributed as \href{https://jupyter.org/}{Jupyter notebooks} (\url{https://jupyter.org}), an open source computing notebook environment that works within a web browser. Jupyter allows one to do among other things, create and execute \href{https://www.python.org/}{Python} (\url{https:/www.python.org}) programs, which are similar in syntax to Matlab. The easiest way to work within a notebook is through Google's \href{https://colab.research.google.com/notebooks/welcome.ipynb}{Colaboratory} (\url{https://colab.research.google.com/notebooks/welcome.ipynb}), a web-based platform, integrated with your Google drive, that allows you to create and execute notebooks without installing anything on your computer. Alternatively, you can download Jupyter and Python as one distribution, at \url{http://anaconda.com/download}. 

You are not required to write solutions within a notebook. Clear, hand-written solutions are acceptable and may even teach you the material more effectively.
\subsection{Good practices}
\label{sec:orgd028f2f}
\textbf{Always} start solutions on a piece of paper. If the solution requires some python code, first write down pseudocode before creating in a notebook. 
\section{Homework Defense}
\label{sec:orgcc044be}
To help me get to know you and how you are doing with the course, after each homework assignment two of you will be chosen at random to meet with me to discuss your homework. Defenses will be in my office during office hours.
\section{Grading}
\label{sec:orgcddcbdb}
Grades will be based on the homework (40\%) and three exams (60\%).
\section{Academic honesty}
\label{sec:org21d38d1}
Should go without saying. This class follows the binding Code of Honor at Notre Dame.  Any cheating or misrepresenting of work as your own will be dealt with according to the policies of the University.  See \url{https://honorcode.nd.edu/}.

Within that policy, you are welcome and even encouraged to take advantage of modern online resources, including generative large language models like \href{https://chatgpt.comm}{ChatGPT} or \href{https://gemini.google.com/app}{Gemini}, to find information or generate code. Document your usage of these or any resources in whatever you turn in, be aware that they are fallible, and be prepared to take responsibility for and defend whatever you turn in as your work. Further, you will work with paper and pencil on exams.
\section{Teaching Assistants and Office Hours}
\label{sec:org25beee5}

\begin{center}
\begin{tabular}{llll}
Henry Lee & \href{mailto:slee75@nd.edu}{slee75@nd.edu} & F 2-3 & ??? NSH\\
Bill Schneider & \href{mailto:wschneider@nd.edu}{wschneider@nd.edu} & T 3-4 & 370 NSH\\
\end{tabular}
\end{center}
\section{Health and Well-Being}
\label{sec:orgc6c47e8}
Resources for students experiencing stress or difficulty coping are available at \url{http://care.nd.edu}. 
\section{Course calendar}
\label{sec:orgb8d0288}
\begin{table}[htbp]
\caption{Tentative Course Calendar}
\centering
\begin{tabular}{ll}
\hline
8/25 & 8/27\\
Welcome! & \textbf{Python notebooks}\\
\hline
9/1 & 9/3\\
 & \textbf{HW 1}\\
\hline
9/8 & 9/10\\
 & \textbf{HW 2}\\
\hline
9/15 & 9/17\\
 & \textbf{HW 3}\\
\hline
9/22 & 9/24\\
\textbf{Exam 1} & \\
\hline
9/29 & 10/1\\
 & \textbf{HW 4}\\
\hline
10/6 & 10/8\\
 & \textbf{HW 5}\\
\hline
10/13 & 10/15\\
 & \textbf{HW 6}\\
\hline
10/20 & 10/22\\
\textbf{BREAK} & \textbf{BREAK}\\
\hline
10/27 & 10/29\\
 & \textbf{HW 7}\\
\hline
11/3 & 11/5\\
\textbf{Exam 2} & \\
\hline
11/10 & 11/12\\
 & \textbf{HW 8}\\
\hline
11/17 & 11/19\\
 & \\
\hline
11/24 & 11/26\\
\textbf{HW 9} & \textbf{Thanksgiving}\\
\hline
12/1 & 12/3\\
 & \textbf{HW 10}\\
\hline
12/8 & 12/10\\
 & \textbf{HW 11}\\
\hline
12/15 & 12/15\\
 & \textbf{Final Exam}\\
\hline
\end{tabular}
\end{table}
\end{document}
